import { Component } from '@angular/core';

@Component({
  selector: 'app-artists',
  templateUrl: './artists.component.html',
  styleUrl: './artists.component.scss'
})
export class ArtistsComponent {

  artists = [
    {
      url: '../../assets/images/semenko.webp',
      title: 'Михайль Семенко',
      text: 'Блискучою містифікацією в тому самому журналі був жартівливий некролог по поетові Семенку, написаний самим Семенком. Річ у тім, що на критику бойчукістів у «Новій генерації» журнал «Літературний ярмарок» озвався таким чином: «Якщо бойчукісти не художники, то й Семенко не поет. Поета Семенка нема». І в некролозі в траурній рамочці зазначалося: «Труп Семенка знайшли на вулиці. Його вбито якимсь тупим знаряддям (можливо, «Літературним ярмарком»)». Услід за некрологом ішли спогади Петрицького про «вбитого» приятеля: «Я бачу, як живого, Семенка: невеликого зросту, з кучерявою кучмою волосся, як у негра. Коли заплющити очі, то він дуже подібний до Пушкіна. А коли розплющити, то бачиш монголоїдні очі. Це пояснюється тим, що його мати довгий час жила як не в Японії, так у Владивостоці».',
    },
    {
      url: '../../assets/images/tychuna.webp',
      title: 'Павло Тичина',
      text: '“Самого Тичину ви у „Слові” рідко зустріли. Створювалося враження, що Тичина навмисне ховається від людей. Ще коли ми жили на Михайлівській площі, Тичина в товаристві Любченка, Хвильового, Досвітнього приходив досить часто до нас. Сідав у куточку і мовчав. Але бували випадки, що Тичина раптом починав говорити. Тоді його спогади про духовну семінарію ставали в центрі загальної уваги. Тичина вмів оповідати смішні до сліз речі, сам не усміхнувшись навіть.”',
    },
    {
      url: '../../assets/images/hwulovuy.webp',
      title: 'Микола Хвильовий',
      text: '“Сказати, що я на свої твори інакше не вмію дивитись, як на світові шедеври, я ніяк не ризикую - хоч би тому, що в цьому разі Ви мене з успіхом можете назвати дрібненьким самохвальком. Але й сказати, що я ж таки на свої твори дивлюсь, як на зразкову халтуру, я теж, на жаль, не можу, бо цю відповідь буде, очевидно, розцінено, як рисовку кокетливої і, до речі, недалекої панночки.”',
    },
    {
      url: '../../assets/images/padalka.webp',
      title: 'Іван Падалка',
      text: '“Падалка мав дружину, яка мало чим уступала йому ростом і вона головна моделька для майже всіх картин, особливо фресок відомих у ті часи на стінах Краснозаводського театру, за які Падалку й Седляра було розстріляно. Падалка високий, підстрижений під спудея, надзвичайно веселої вдачі, товариський і добрий тато одинокого синка. Я бував у мешканні Падалки. Там було багато портретів, ескізів декорацій, незакінчені пейзажі, а надусе повно плахт, кераміки як у якому українському музею. Його картини й були дуже українські, свіжі як фолкльор, дарма, що били його за формалізм „ворожий народові”... Падалка ніколи не відмовлявся заграти у відбиванку за пиво.”',
    },
    {
      url: '../../assets/images/valentuna.webp',
      title: 'Валентина Чистякова',
      text: '“Валентина Миколаївна була одною з найкращих і найелегантніших жінок Харкова. Надзвичайно проста і мила в приватному житті — була ця найкраща акторка Березоля.”',
    },
    {
      url: '../../assets/images/epik.webp',
      title: 'Григорій Епік',
      text: '“Епік був чорнявий, з виразною ямочкою в бороді. Арештували Епіка 6 грудня 1934 року. Після закінчення слідства Постишев випустив книжечку, в якій наводив ніби автентичний Епіковий лист до Сталіна, мовляв, Епік у всьому кається, признається до терору, контрреволюції, і просить НКВД усіх українських письменників „розстріляти як скажених псів”. (Я ніколи не забуду того жахливого враження від цієї книжки! Це ж була перша офіційна вістка про долю заарештованих у Харкові. До того часу доля наших батьків була нам абсолютно невідома. Це був присуд, який назавжди перекреслював усі надії на повернення ув’язнених.)”',
    },
    {
      url: '../../assets/images/golovko.webp',
      title: 'Андрій Головко',
      text: '“Автор відомої тоді повісти ,,Бур’ян”, яку ми навіть у школі мусіли ,,вивчати”. Замкнутий, неговіркий, несимпатичний. Одним словом, саме тобі „не”. Ходили чутки, може це й була правда, що Головко під час революції застрелив свою жінку. Чого, защо і навіщо — невідомо. Був жонатий з молодою сестрінкою жидівського письменника Квітки. Жив Головко якось осібно від усіх і, здається, не багато мав приятелів. Дітей у Головків не було.”',
    },
    {
      url: '../../assets/images/paniv.webp',
      title: 'Андрій Панів',
      text: '“Жив він на третьому поверсі, проти Хвильового. Ходив до Хвильового позичати машинки, на якій писав свої виступи проти Хвильового. Хвильовий сердився, казав: «Ну, що ж... І такі сусіди бувають!» На вечірках любив читати набридлий всім віршик: «Коли пас я маленьким гусят, мені сонце всміхалося любо...» [129] Не любив цього вірша я. Та от випала нагода — поїхав хлопець в Грузію, в Тбілісі. Назад повернувся з циклом [130], з якого видно було, що і з Паніва міг би бути поет...”',
    },
    {
      url: '../../assets/images/image 2.webp',
      title: 'Михайло Биковець',
      text: '“Журналіст, бистрий на перо, який з незрівнянною оперативністю і майстерністю обслуговував сьогоднішній день. Людина діла. Це на ньому довгі роки тримався «Плуг» і його орган «Плужанин». Численні свої опуси підписував здебільшого псевдонімом Марусик, а частіше — урізаним прізвищем і ім’ям — Мих. Бик. чи Бик. Мих. Жартуючи, літератори вигадали йому ще кілька таких прізвищ: Мих Хим, Хим Мих, Мих Киб, Киб Мих тощо.”',
    },
    {
      url: '../../assets/images/petruskuy.webp',
      title: 'Анатоль Петрицький',
      text: '“П’ятдесят другого року я побувала в Кракові і з молодим комсомольським запалом переконувала краківських абстракціоністів у перевагах соцреалізму. Повернувшись до Києва, я розповіла нашим художникам про загнивання західної культури. Петрицький підійшов до мене і сказав: Навіщо Ви говорите про те, чого не знаєте? Мені стало соромно. Наступного дня на партзборах мав виступати Петрицький і з трибуни, в якості секретаря парторганізації, він таврував «гнилий Захід» вчорашніми моїми словами.”',
    },
  ];


  items = [
    {
      url: '../../assets/images/picture_10.webp', 
      description: 'У будинку «Слово» жили зовсім різні люди з досить різнобарвним минулим. "Весь цвіт письменства УРСР у роки громадянської війни виступав під українськими прапорами зі зброєю в руках проти більшовиків. Петлюрівськими офіцерами були Петро Панч та Андрій Головко, завзятими юнаками (юнкерами) — Володимир Сосюра і Борис Антоненко-Давидович, добровольцями-кавалеристами — Олександр Копиленко та навіть 16-річний Юрій Яновський. Держчиновниками УНР — Павло Губенко (Остап Вишня), Павло Тичина, Юрій Смолич … Частина з них на початку 1920 року опинилися в лавах боротьбистів і разом з ними перейшли до більшовиків. Але декого, наприклад Остапа Вишню і, за деякими даними, Юрія Яновського, червоні взяли в полон. Але петлюрівська закваска в них залишилася назавжди." Історик Ярослав Тинченко',
      description2: 'Але не менше було й прихильників соціалістичних, комуністичних ідей. Такими можна назвати Миколу Хвильового, Михайла Ялового, Сергія Пилипенка, Олеся Досвітнього, Майка Йогансена.'
    }
  ]

  items1 = [
    {
      url: '../../assets/images/picrure_11.webp',
      description: '“Тепер місця вдосталь і для рояля, і для великої бібліотеки. Мисливець Вишня виділив своїм собакам цілу кімнату. Хоча й тут були деякі складнощі (миші, міль, опалювали вугіллям), але все одно це були шикарні на той час житлові умови.”',
    }
  ]
}
