import { Component } from '@angular/core';

@Component({
  selector: 'app-artists',
  templateUrl: './artists.component.html',
  styleUrl: './artists.component.scss'
})
export class ArtistsComponent {
  items = [
    {
      url: '../../assets/images/picture_10.jpg', 
      description: 'У будинку «Слово» жили зовсім різні люди з досить різнобарвним минулим. "Весь цвіт письменства УРСР у роки громадянської війни виступав під українськими прапорами зі зброєю в руках проти більшовиків. Петлюрівськими офіцерами були Петро Панч та Андрій Головко, завзятими юнаками (юнкерами) — Володимир Сосюра і Борис Антоненко-Давидович, добровольцями-кавалеристами — Олександр Копиленко та навіть 16-річний Юрій Яновський. Держчиновниками УНР — Павло Губенко (Остап Вишня), Павло Тичина, Юрій Смолич … Частина з них на початку 1920 року опинилися в лавах боротьбистів і разом з ними перейшли до більшовиків. Але декого, наприклад Остапа Вишню і, за деякими даними, Юрія Яновського, червоні взяли в полон. Але петлюрівська закваска в них залишилася назавжди." Історик Ярослав Тинченко',
      description2: 'Але не менше було й прихильників соціалістичних, комуністичних ідей. Такими можна назвати Миколу Хвильового, Михайла Ялового, Сергія Пилипенка, Олеся Досвітнього, Майка Йогансена.'
    }
  ]

  items1 = [
    {
      url: '../../assets/images/picrure_11.jpg',
      description: '“Тепер місця вдосталь і для рояля, і для великої бібліотеки. Мисливець Вишня виділив своїм собакам цілу кімнату. Хоча й тут були деякі складнощі (миші, міль, опалювали вугіллям), але все одно це були шикарні на той час житлові умови.”',
    }
  ]
}
