import { Component } from '@angular/core';

@Component({
  selector: 'app-history',
  templateUrl: './history.component.html',
  styleUrl: './history.component.scss',
})
export class HistoryComponent {
  slideConfig = {
    slidesToShow: 1,
    slidesToScroll: 1,
    dots: true,
    infinite: true,
    autoplay: true,
    autoplaySpeed: 3000,
  };

  images = [
    {
      img: 'assets/images/picture_7.jpg',
      text: 'Хвиля репресій зачепила 40 квартир із 66. Розстріляні — 33 особи, заслані на довгі роки — 3, померли в засланні — 2, наклали на себе руки — 1, убиті/померли за незрозумілих обставин — 1.',
    },
    {
      img: 'assets/images/picture_9.jpg',
      text: 'Репресії проти української інтелігенції мали цілеспрямований характер. Радянська влада бажала знищити українську національну свідомість та встановити тотальний контроль над усіма сферами життя.',
    },
  ];

  items: any[] = [
    {
      url: '../../assets/images/picture_3.jpg',
      title:
        'Столицею України та центром культурного життя тоді був Харків, де і запланували будівництво «Слова» на околиці міста. Назва, до речі, продиктувала архітектуру символічну форму будинку – у формі літери «С».',
      description:
        'Архітектор Митрофан Дашкевич продумав усе до дрібниць: навіть солярій на даху і дитсадок. Будували з найкращих на той час матеріалів. Та насправді з золота кували клітку, і вже зовсім скоро письменники пожалкують про своє прохання.',
    },
    {
      url: '../../assets/images/picrure_4.jpg',
      description:
        'У 1929 році будинок починають заселяти. 5 під’їздів, 5 поверхів, 66 квартир. Серед мешканців найбільше літераторів: Микола Хвильовий, Остап Вишня, Іван Багряний, Валер’ян Підмогильний, Михайль Семенко, Майк Йогансен та інші. Були драматурги й актори, зокрема Микола Куліш та Лесь Курбас, очільник театру «Березіль». Непересічні художники-«бойчукісти», як-от Іван Падалка і Василь Седляр.',
    },
  ];

  items1: any[] = [
    {
      url: '../../assets/images/picture_6.jpg',
      description:
        'У «Слові» починається життя: мешканці пліч-о-пліч створюють свої шедеври, ходять одне до одного на чай, позичають у Курбаса книжки про мистецтво, діляться ідеями на сходових прогонах. Тут пише Підмогильний, який приносить в українську літературу екзистенціалізм, з’являються виняткові поезії символіста Тичини, працює над модерними виставами нерозлучний тандем Куліш-Курбас. У цих квартирах панує дух новаторства, свобода думки і віра в українське мистецтво. Та за богемою пильнують — протягом усіх 20-тих років. Радянській владі не потрібна українська мрія — вона хоче відновити імперію. Згодом на митців почнуть надходити доноси, влада згорне українізацію, а за кілька років від голоду вимиратимуть українські села.',
      description2:
        'У 1930-ті під увагу НКВС потрапляють жителі більшості квартир будинку «Слово». «Першою ластівкою» вважають Галину Орлівну — акторку з квартири №27. Її першого чоловіка арештували раніше й засудили до смертної кари. Галині дали 5 років, а по закінченні строку вона вже не мала права повертатися в Україну. 12 травня 1933 року чекісти забирають Михайла Ялового. «Арешт Ялового — це розстріл цілої генерації», — каже наступного дня Хвильовий і стріляє собі у скроню. Протягом кількох наступних років жителів «Слова» одне за одним вивозять у чорних «воронках». Далі типовий сценарій — вирок, табір, розстріл. Зникає покоління митців. Їхні твори нищать, їх самих таврують ганьбою, називають «буржуазними націоналістами» і «шпигунами», а то й не згадують зовсім.',
    },
  ];
}
